name: "CALTECH101_net4"
layer {
  name: "net4"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mean_file: "ldj_workspace/caltech101/imagenet_mean.binaryproto"
    scale: 0.00390625
  }
  image_data_param {
    source: "ldj_workspace/caltech101/train.txt"
    batch_size: 25
    new_height: 256
    new_width: 256
  }
}
layer {
  name: "net4"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mean_file: "ldj_workspace/caltech101/imagenet_mean.binaryproto"
    scale: 0.00390625
  }
  image_data_param {
    source: "ldj_workspace/caltech101/test.txt"
    batch_size: 25
    new_height: 256
    new_width: 256
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 100
    kernel_size: 3
    stride: 1
    weight_filler{
     # type: "gaussian" 
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 50
    kernel_size: 3
    stride: 1
    weight_filler {
     # type: "gaussian" 
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  top: "conv2"
  bottom: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  top: "conv3"
  bottom: "pool2"
  # This is used to update the weights
  param {
    lr_mult: 1
  }
  # This is used to update the bias
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 50
    kernel_size: 3
    stride: 1
    pad: 1
    weight_filler {
      #type: "gaussian"     
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  top: "conv3"
  bottom: "conv3"
}
layer {
  name: "conv3_1"
  type: "Convolution"
  top: "conv3_1"
  bottom: "pool2"
  # This is used to update the weights
  param {
    lr_mult: 1
  }
  # This is used to update the bias
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 50
    kernel_size: 1
    stride: 1
    weight_filler {
      #type: "gaussian"     
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "concat_c3"
  type: "Concat"
  bottom: "conv3"
  bottom: "conv3_1"
  top: "concat_c3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "concat_c3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride:2
  }
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "pool3"
  top: "ip1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "ip1"
  top: "ip1"
}
layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 101
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}
